modm-ext/archive-stmicro-svd/header_stm32l4s7aii6.svd
        <register>
          <name>LUT.1274</name>
          <addressOffset>0x23e8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1275</name>
          <addressOffset>0x23ec</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1276</name>
          <addressOffset>0x23f0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1277</name>
          <addressOffset>0x23f4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1278</name>
          <addressOffset>0x23f8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1279</name>
          <addressOffset>0x23fc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1280</name>
          <addressOffset>0x2400</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1281</name>
          <addressOffset>0x2404</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1282</name>
          <addressOffset>0x2408</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1283</name>
          <addressOffset>0x240c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1284</name>
          <addressOffset>0x2410</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1285</name>
          <addressOffset>0x2414</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1286</name>
          <addressOffset>0x2418</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1287</name>
          <addressOffset>0x241c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1288</name>
          <addressOffset>0x2420</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1289</name>
          <addressOffset>0x2424</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1290</name>
          <addressOffset>0x2428</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1291</name>
          <addressOffset>0x242c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1292</name>
          <addressOffset>0x2430</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1293</name>
          <addressOffset>0x2434</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1294</name>
          <addressOffset>0x2438</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1295</name>
          <addressOffset>0x243c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1296</name>
          <addressOffset>0x2440</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1297</name>
          <addressOffset>0x2444</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1298</name>
          <addressOffset>0x2448</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1299</name>
          <addressOffset>0x244c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1300</name>
          <addressOffset>0x2450</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1301</name>
          <addressOffset>0x2454</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1302</name>
          <addressOffset>0x2458</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1303</name>
          <addressOffset>0x245c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1304</name>
          <addressOffset>0x2460</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1305</name>
          <addressOffset>0x2464</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1306</name>
          <addressOffset>0x2468</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1307</name>
          <addressOffset>0x246c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1308</name>
          <addressOffset>0x2470</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1309</name>
          <addressOffset>0x2474</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1310</name>
          <addressOffset>0x2478</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1311</name>
          <addressOffset>0x247c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1312</name>
          <addressOffset>0x2480</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1313</name>
          <addressOffset>0x2484</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1314</name>
          <addressOffset>0x2488</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1315</name>
          <addressOffset>0x248c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1316</name>
          <addressOffset>0x2490</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1317</name>
          <addressOffset>0x2494</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1318</name>
          <addressOffset>0x2498</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1319</name>
          <addressOffset>0x249c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1320</name>
          <addressOffset>0x24a0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1321</name>
          <addressOffset>0x24a4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1322</name>
          <addressOffset>0x24a8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1323</name>
          <addressOffset>0x24ac</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1324</name>
          <addressOffset>0x24b0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1325</name>
          <addressOffset>0x24b4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1326</name>
          <addressOffset>0x24b8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1327</name>
          <addressOffset>0x24bc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1328</name>
          <addressOffset>0x24c0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1329</name>
          <addressOffset>0x24c4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1330</name>
          <addressOffset>0x24c8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1331</name>
          <addressOffset>0x24cc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1332</name>
          <addressOffset>0x24d0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1333</name>
          <addressOffset>0x24d4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1334</name>
          <addressOffset>0x24d8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1335</name>
          <addressOffset>0x24dc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1336</name>
          <addressOffset>0x24e0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1337</name>
          <addressOffset>0x24e4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1338</name>
          <addressOffset>0x24e8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1339</name>
          <addressOffset>0x24ec</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1340</name>
          <addressOffset>0x24f0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1341</name>
          <addressOffset>0x24f4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1342</name>
          <addressOffset>0x24f8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1343</name>
          <addressOffset>0x24fc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1344</name>
          <addressOffset>0x2500</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1345</name>
          <addressOffset>0x2504</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1346</name>
          <addressOffset>0x2508</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1347</name>
          <addressOffset>0x250c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1348</name>
          <addressOffset>0x2510</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1349</name>
          <addressOffset>0x2514</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1350</name>
          <addressOffset>0x2518</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1351</name>
          <addressOffset>0x251c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1352</name>
          <addressOffset>0x2520</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1353</name>
          <addressOffset>0x2524</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1354</name>
          <addressOffset>0x2528</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1355</name>
          <addressOffset>0x252c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1356</name>
          <addressOffset>0x2530</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1357</name>
          <addressOffset>0x2534</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1358</name>
          <addressOffset>0x2538</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1359</name>
          <addressOffset>0x253c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1360</name>
          <addressOffset>0x2540</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1361</name>
          <addressOffset>0x2544</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1362</name>
          <addressOffset>0x2548</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1363</name>
          <addressOffset>0x254c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1364</name>
          <addressOffset>0x2550</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1365</name>
          <addressOffset>0x2554</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1366</name>
          <addressOffset>0x2558</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1367</name>
          <addressOffset>0x255c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1368</name>
          <addressOffset>0x2560</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1369</name>
          <addressOffset>0x2564</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1370</name>
          <addressOffset>0x2568</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1371</name>
          <addressOffset>0x256c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1372</name>
          <addressOffset>0x2570</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1373</name>
          <addressOffset>0x2574</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1374</name>
          <addressOffset>0x2578</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1375</name>
          <addressOffset>0x257c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1376</name>
          <addressOffset>0x2580</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1377</name>
          <addressOffset>0x2584</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1378</name>
          <addressOffset>0x2588</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1379</name>
          <addressOffset>0x258c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1380</name>
          <addressOffset>0x2590</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1381</name>
          <addressOffset>0x2594</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1382</name>
          <addressOffset>0x2598</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1383</name>
          <addressOffset>0x259c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1384</name>
          <addressOffset>0x25a0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1385</name>
          <addressOffset>0x25a4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1386</name>
          <addressOffset>0x25a8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1387</name>
          <addressOffset>0x25ac</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1388</name>
          <addressOffset>0x25b0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1389</name>
          <addressOffset>0x25b4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1390</name>
          <addressOffset>0x25b8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1391</name>
          <addressOffset>0x25bc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1392</name>
          <addressOffset>0x25c0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1393</name>
          <addressOffset>0x25c4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1394</name>
          <addressOffset>0x25c8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1395</name>
          <addressOffset>0x25cc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1396</name>
          <addressOffset>0x25d0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1397</name>
          <addressOffset>0x25d4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1398</name>
          <addressOffset>0x25d8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1399</name>
          <addressOffset>0x25dc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1400</name>
          <addressOffset>0x25e0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1401</name>
          <addressOffset>0x25e4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1402</name>
          <addressOffset>0x25e8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1403</name>
          <addressOffset>0x25ec</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1404</name>
          <addressOffset>0x25f0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1405</name>
          <addressOffset>0x25f4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1406</name>
          <addressOffset>0x25f8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1407</name>
          <addressOffset>0x25fc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1408</name>
          <addressOffset>0x2600</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1409</name>
          <addressOffset>0x2604</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1410</name>
          <addressOffset>0x2608</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1411</name>
          <addressOffset>0x260c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1412</name>
          <addressOffset>0x2610</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1413</name>
          <addressOffset>0x2614</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1414</name>
          <addressOffset>0x2618</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1415</name>
          <addressOffset>0x261c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1416</name>
          <addressOffset>0x2620</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1417</name>
          <addressOffset>0x2624</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1418</name>
          <addressOffset>0x2628</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1419</name>
          <addressOffset>0x262c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1420</name>
          <addressOffset>0x2630</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1421</name>
          <addressOffset>0x2634</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1422</name>
          <addressOffset>0x2638</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1423</name>
          <addressOffset>0x263c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1424</name>
          <addressOffset>0x2640</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1425</name>
          <addressOffset>0x2644</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1426</name>
          <addressOffset>0x2648</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1427</name>
          <addressOffset>0x264c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1428</name>
          <addressOffset>0x2650</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1429</name>
          <addressOffset>0x2654</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1430</name>
          <addressOffset>0x2658</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1431</name>
          <addressOffset>0x265c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1432</name>
          <addressOffset>0x2660</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1433</name>
          <addressOffset>0x2664</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1434</name>
          <addressOffset>0x2668</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1435</name>
          <addressOffset>0x266c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1436</name>
          <addressOffset>0x2670</addressOffset>
          <size>0x20</size>
        </register>
