modm-ext/archive-stmicro-svd/header_stm32l4s7aii6.svd
        <register>
          <name>LUT.1437</name>
          <addressOffset>0x2674</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1438</name>
          <addressOffset>0x2678</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1439</name>
          <addressOffset>0x267c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1440</name>
          <addressOffset>0x2680</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1441</name>
          <addressOffset>0x2684</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1442</name>
          <addressOffset>0x2688</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1443</name>
          <addressOffset>0x268c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1444</name>
          <addressOffset>0x2690</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1445</name>
          <addressOffset>0x2694</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1446</name>
          <addressOffset>0x2698</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1447</name>
          <addressOffset>0x269c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1448</name>
          <addressOffset>0x26a0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1449</name>
          <addressOffset>0x26a4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1450</name>
          <addressOffset>0x26a8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1451</name>
          <addressOffset>0x26ac</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1452</name>
          <addressOffset>0x26b0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1453</name>
          <addressOffset>0x26b4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1454</name>
          <addressOffset>0x26b8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1455</name>
          <addressOffset>0x26bc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1456</name>
          <addressOffset>0x26c0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1457</name>
          <addressOffset>0x26c4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1458</name>
          <addressOffset>0x26c8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1459</name>
          <addressOffset>0x26cc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1460</name>
          <addressOffset>0x26d0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1461</name>
          <addressOffset>0x26d4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1462</name>
          <addressOffset>0x26d8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1463</name>
          <addressOffset>0x26dc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1464</name>
          <addressOffset>0x26e0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1465</name>
          <addressOffset>0x26e4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1466</name>
          <addressOffset>0x26e8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1467</name>
          <addressOffset>0x26ec</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1468</name>
          <addressOffset>0x26f0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1469</name>
          <addressOffset>0x26f4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1470</name>
          <addressOffset>0x26f8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1471</name>
          <addressOffset>0x26fc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1472</name>
          <addressOffset>0x2700</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1473</name>
          <addressOffset>0x2704</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1474</name>
          <addressOffset>0x2708</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1475</name>
          <addressOffset>0x270c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1476</name>
          <addressOffset>0x2710</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1477</name>
          <addressOffset>0x2714</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1478</name>
          <addressOffset>0x2718</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1479</name>
          <addressOffset>0x271c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1480</name>
          <addressOffset>0x2720</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1481</name>
          <addressOffset>0x2724</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1482</name>
          <addressOffset>0x2728</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1483</name>
          <addressOffset>0x272c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1484</name>
          <addressOffset>0x2730</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1485</name>
          <addressOffset>0x2734</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1486</name>
          <addressOffset>0x2738</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1487</name>
          <addressOffset>0x273c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1488</name>
          <addressOffset>0x2740</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1489</name>
          <addressOffset>0x2744</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1490</name>
          <addressOffset>0x2748</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1491</name>
          <addressOffset>0x274c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1492</name>
          <addressOffset>0x2750</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1493</name>
          <addressOffset>0x2754</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1494</name>
          <addressOffset>0x2758</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1495</name>
          <addressOffset>0x275c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1496</name>
          <addressOffset>0x2760</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1497</name>
          <addressOffset>0x2764</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1498</name>
          <addressOffset>0x2768</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1499</name>
          <addressOffset>0x276c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1500</name>
          <addressOffset>0x2770</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1501</name>
          <addressOffset>0x2774</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1502</name>
          <addressOffset>0x2778</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1503</name>
          <addressOffset>0x277c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1504</name>
          <addressOffset>0x2780</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1505</name>
          <addressOffset>0x2784</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1506</name>
          <addressOffset>0x2788</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1507</name>
          <addressOffset>0x278c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1508</name>
          <addressOffset>0x2790</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1509</name>
          <addressOffset>0x2794</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1510</name>
          <addressOffset>0x2798</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1511</name>
          <addressOffset>0x279c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1512</name>
          <addressOffset>0x27a0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1513</name>
          <addressOffset>0x27a4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1514</name>
          <addressOffset>0x27a8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1515</name>
          <addressOffset>0x27ac</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1516</name>
          <addressOffset>0x27b0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1517</name>
          <addressOffset>0x27b4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1518</name>
          <addressOffset>0x27b8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1519</name>
          <addressOffset>0x27bc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1520</name>
          <addressOffset>0x27c0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1521</name>
          <addressOffset>0x27c4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1522</name>
          <addressOffset>0x27c8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1523</name>
          <addressOffset>0x27cc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1524</name>
          <addressOffset>0x27d0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1525</name>
          <addressOffset>0x27d4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1526</name>
          <addressOffset>0x27d8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1527</name>
          <addressOffset>0x27dc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1528</name>
          <addressOffset>0x27e0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1529</name>
          <addressOffset>0x27e4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1530</name>
          <addressOffset>0x27e8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1531</name>
          <addressOffset>0x27ec</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1532</name>
          <addressOffset>0x27f0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1533</name>
          <addressOffset>0x27f4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1534</name>
          <addressOffset>0x27f8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1535</name>
          <addressOffset>0x27fc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1536</name>
          <addressOffset>0x2800</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1537</name>
          <addressOffset>0x2804</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1538</name>
          <addressOffset>0x2808</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1539</name>
          <addressOffset>0x280c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1540</name>
          <addressOffset>0x2810</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1541</name>
          <addressOffset>0x2814</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1542</name>
          <addressOffset>0x2818</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1543</name>
          <addressOffset>0x281c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1544</name>
          <addressOffset>0x2820</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1545</name>
          <addressOffset>0x2824</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1546</name>
          <addressOffset>0x2828</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1547</name>
          <addressOffset>0x282c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1548</name>
          <addressOffset>0x2830</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1549</name>
          <addressOffset>0x2834</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1550</name>
          <addressOffset>0x2838</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1551</name>
          <addressOffset>0x283c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1552</name>
          <addressOffset>0x2840</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1553</name>
          <addressOffset>0x2844</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1554</name>
          <addressOffset>0x2848</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1555</name>
          <addressOffset>0x284c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1556</name>
          <addressOffset>0x2850</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1557</name>
          <addressOffset>0x2854</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1558</name>
          <addressOffset>0x2858</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1559</name>
          <addressOffset>0x285c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1560</name>
          <addressOffset>0x2860</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1561</name>
          <addressOffset>0x2864</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1562</name>
          <addressOffset>0x2868</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1563</name>
          <addressOffset>0x286c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1564</name>
          <addressOffset>0x2870</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1565</name>
          <addressOffset>0x2874</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1566</name>
          <addressOffset>0x2878</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1567</name>
          <addressOffset>0x287c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1568</name>
          <addressOffset>0x2880</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1569</name>
          <addressOffset>0x2884</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1570</name>
          <addressOffset>0x2888</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1571</name>
          <addressOffset>0x288c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1572</name>
          <addressOffset>0x2890</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1573</name>
          <addressOffset>0x2894</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1574</name>
          <addressOffset>0x2898</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1575</name>
          <addressOffset>0x289c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1576</name>
          <addressOffset>0x28a0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1577</name>
          <addressOffset>0x28a4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1578</name>
          <addressOffset>0x28a8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1579</name>
          <addressOffset>0x28ac</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1580</name>
          <addressOffset>0x28b0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1581</name>
          <addressOffset>0x28b4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1582</name>
          <addressOffset>0x28b8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1583</name>
          <addressOffset>0x28bc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1584</name>
          <addressOffset>0x28c0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1585</name>
          <addressOffset>0x28c4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1586</name>
          <addressOffset>0x28c8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1587</name>
          <addressOffset>0x28cc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1588</name>
          <addressOffset>0x28d0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1589</name>
          <addressOffset>0x28d4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1590</name>
          <addressOffset>0x28d8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1591</name>
          <addressOffset>0x28dc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1592</name>
          <addressOffset>0x28e0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1593</name>
          <addressOffset>0x28e4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1594</name>
          <addressOffset>0x28e8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1595</name>
          <addressOffset>0x28ec</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1596</name>
          <addressOffset>0x28f0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1597</name>
          <addressOffset>0x28f4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1598</name>
          <addressOffset>0x28f8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1599</name>
          <addressOffset>0x28fc</addressOffset>
          <size>0x20</size>
        </register>
